const quizArray = [
    {
        id: "0",
        type: "inattention",
        question: "Я неспособен уделять внимание деталям и допускаю ошибки из-за невнимательности — в учёбе, работе или других видах активности*",
    },
    {
        id: "1",
        type: "inattention",
        question: "Мне сложно сосредоточиться и удерживать внимание во время лекций, чтения или разговора*",
    },
    {
        id: "2",
        type: "inattention",
        question: "Во время общения с другими людьми, мыслями я нахожусь в другом месте (даже когда ничего меня явно не отвлекает)*",
    },
    {
        id: "3",
        type: "inattention",
        question: "Мне тяжело следовать инструкциям и доводить до конца рабочие задачи, задания по учёбе или домашние дела. Я быстро теряю фокус и легко отвлекаюсь*",
    },
    {
        id: "4",
        type: "inattention",
        question: "Мне трудно организовать задачи в последовательный, пошаговый план. Работа носит беспорядочный характер. Я плохо управляю временем, часто опаздываю и не соблюдаю сроки.*",
    },
    {
        id: "5",
        type: "inattention",
        question: "Мне тяжело справляться с задачами, которые требуют концентрации и постоянных умственных усилий. Например, подготовить отчёт, заполнить бланк, прочитать и внести правки в договор*",
    },
    {
        id: "6",
        type: "inattention",
        question: "Я теряю вещи — ручки, ключи, кошельки, банковские карты, мобильные телефоны и прочие важные, дорогие вещи.*",
    },
    {
        id: "7",
        type: "inattention",
        question: "Я часто отвлекаюсь на посторонние стимулы. Любая случившаяся мелочь может легко отвлечь меня от текущих дел*",
    },
    {
        id: "8",
        type: "inattention",
        question: "Я забывчив в повседневной жизни. Забываю выполнить домашние обязанности и просьбы. Забываю перезвонить, оплатить счёт, записаться на приём и т.д.*",
    },
    {
        id: "9",
        type: "impulsivity",
        question: "Я двигаю, подёргиваю, постукиваю руками или ногами или «ёрзаю» на сиденье*",
    },
    {
        id: "10",
        type: "impulsivity",
        question: "Покидаю свое место в ситуациях, когда ожидается, что я останусь сидеть (например, встаю из-за стола в аудитории, в офисе или на другом рабочем месте, а также в других ситуациях, требующих постоянного присутствия на месте)*",
    },
    {
        id: "11",
        type: "impulsivity",
        question: "Бываю чрезмерно активен в ситуациях, где это неуместно (перебиваю людей, хожу по комнате, беспокоюсь без видимой причины)*",
    },
    {
        id: "12",
        type: "impulsivity",
        question: "Испытываю трудности со спокойными занятиями или отдыхом. Хочется встать и начать что-то делать*",
    },
    {
        id: "13",
        type: "impulsivity",
        question: "Все делаю на бегу, как будто с заведенным мотором (например, не могу или с большим трудом остаюсь неподвижным в течение длительного времени в таких местах, как рестораны или встречи). Могу восприниматься другими как беспокойный человек, или тот, за которым не угнаться*",
    },
    {
        id: "14",
        type: "impulsivity",
        question: "Чрезмерно много и эмоционально говорю*",
    },
    {
        id: "15",
        type: "impulsivity",
        question: "Часто выпаливаю ответ до того, как вопрос был завершен (заканчиваю предложения за людей; не могу дождаться своей очереди в разговоре)*",
    },
    {
        id: "16",
        type: "impulsivity",
        question: "Часто испытываю трудности в ожидании своей очереди*",
    },
    {
        id: "17",
        type: "impulsivity",
        question: "Часто перебиваю людей или вторгаюсь в чужие дела (вмешиваюсь в разговоры, игры или занятия; могу использовать чужие вещи без спроса или не дождавшись разрешения)*",
    },
];
