const quizArray = [
    {
        id: "0",
        type: "inattention",
        question: "Я неспособен уделять внимание деталям и допускаю ошибки из-за невнимательности — в учёбе, работе или других видах активности*",
    },
    {
        id: "1",
        type: "inattention",
        question: "Мне сложно сосредоточиться и удерживать внимание во время лекций, чтения или разговора*",
    },
    {
        id: "2",
        type: "inattention",
        question: "Во время общения с другими людьми, мыслями я нахожусь в другом месте (даже когда ничего меня явно не отвлекает)*",
    },
    {
        id: "3",
        type: "inattention",
        question: "Мне тяжело следовать инструкциям и доводить до конца рабочие задачи, задания по учёбе или домашние дела. Я быстро теряю фокус и легко отвлекаюсь*",
    },
];
